load-test/artillery/verify_api_key.yaml
# Copyright 2017 Google Inc.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

config:
  target: http://localhost:9000
  http:
    timeout: 10
  phases:
    - duration: 5
      arrivalRate: 100
      name: "arrival rate=100"
    - pause: 5
    - duration: 5
      arrivalRate: 200
      name: "arrival rate=200"
    - pause: 5
    - duration: 5
      arrivalRate: 300
      name: "arrival rate=300"
    - pause: 5
    - duration: 5
      arrivalRate: 400
      name: "arrival rate=400"
  processor: "./verify_api_key.js"

scenarios:
  -
    name: "Verify Api key ping"
    flow:
      -
        post:
          url: "/verifiers/apikey"
          afterResponse: "captureVerifyApiKey"
          json:
            action : "verify"
            key : "pXcCxLsRgYM4kmmptZa5GG1LOmAXAUPj"
            uriPath : "/"
            organizationName : "eaptest5"
            environmentName : "test"
            apiProxyName : ""
            validateAgainstApiProxiesAndEnvs : false